{
    "C15C8.4": "C15C8.4 encodes an ortholog of human low density lipoprotein receptor-related protein associated protein 1 (HGNC:LRPAP1); C15C8.4 is predicted to have heparin binding activity and low-density lipoprotein particle receptor binding activity, based on protein domain information.",
    "F16C3.1": "F16C3.1 encodes an ortholog of human thyrotropin-releasing hormone receptor (HGNC:TRHR); F16C3.1 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "F39B2.8": "F39B2.8 encodes an ortholog of human G protein-coupled receptor 158 (HGNC:GPR158); F39B2.8 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "F59B2.13": "F59B2.13 encodes an ortholog of human histamine receptor H2 (HGNC:HRH2); F59B2.13 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "R13H7.2": "R13H7.2 encodes an ortholog of human neuromedin U receptor 2 (HGNC:NMUR2); R13H7.2 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "abts-1": "abts-1 encodes a sodium-driven chloride-bicarbonate transporter; when expressed in Xenopus oocytes, ABTS-1 exhibits robust chloride transport, as well as chloride/bicarbonate exchange activity; abts-1 responds to arsenite in the environment with an increase in mRNA levels and is required for protection against toxicity of arsenite; abts-1 is involved in cholinergic signaling as abts-1 mutant worms are hypersensitive to the paralytic effects of the cholinesterase inhibitor, aldicarb, and the nicotinic acetylcholine receptor agonist, levamisole, and arsenite enhances both these sensitivities, indicating the neuronal effects of arsenite and abts-1; abts-1 also functions partially redundantly with the potassium chloride co-transporter kcc-2, to mediate inhibitory GABA signaling in the HSNs (hermaphrodite-specific neurons) that control egg-laying, and in body wall muscles that control body length and movement; abts-1 promoter gfp fusions are expressed primarily in neurons and hypodermis, with weak fluorescence also seen in the pharynx and body wall muscle cells.",
    "acr-12": "acr-12 encodes a nicotinic acetylcholine receptor (nAChR) alpha subunit that is a member of the ACR-8-like group of C. elegans nAChR subunits; as an nAChR subunit, ACR-12 is predicted to mediate fast excitatory neurotransmission, however loss of acr-12 activity via mutation or RNAi results in no obvious defects; ACR-12 copurifies with UNC-29 and LEV-1, suggesting that ACR-12 can form receptors with these two non-alpha AChR subunits; an ACR-12::GFP fusion protein is expressed exclusively in ventral cord motor neurons, including the D neurons; in vivo, ACR-12 colocalizes with some, but not all, UNC-38-containing postsynaptic receptor clusters, suggesting that ACR-12 contributes to only a subset of these receptor clusters.",
    "acr-15": "A homolog of an alpha type nicotinic acetylcholine receptor subunit involved in the mediation of fast synaptic transmission at neuromuscular junctions.",
    "acr-16": "acr-16 encodes an alpha-7-like homomer-forming subunit of the nicotinic acetylcholine receptor (nAChR) superfamily orthologous to human nicotinic cholinergic receptor alpha 7 (CHRNA7; OMIM:118511; possibly associated with schizophrenia and juvenile myoclonic epilepsy); ACR-16 functions as a ligand-gated ion channel that is required for the major fast cholinergic excitatory current at C. elegans neuromuscular junctions; when expressed in Xenopus ooctyes, ACR-16 is active as a homomeric receptor and responds robustly to acetylcholine; an ACR-16::GFP reporter fusion expressed in muscle cells localizes to the tips of muscle arms, specific regions of the muscle cell membrane that form synapses with neuronal processes; acr-16::gfp promoter fusions also reveal expression in a subset of neurons; ACR-16 localization to postsynaptic regions, a key component of activity-dependent synaptic plasticity, is regulated by a Wnt signaling pathway that includes CWN-2, LIN-17, CAM-1, and DSH-1.",
    "acr-18": "acr-18 encodes an alpha subunit of nicotinic acetylcholine receptor (nAChR), predicted to be a ligand-gated ion channel regulating fast action of acetylcholine at neuromuscular junctions and in the nervous system; ACR-18 falls into the 'DEG-3' class of nAChR subunits, apparently unique to nematodes, which includes DEG-3, DES-2, ACR-5, ACR-17, ACR-20, and ACR-23.",
    "acr-2": "A homolog of a non-alpha type nicotinic acetylcholine receptor subunit that forms a functional channel when co-expressed with the unc-38 alpha subunit.",
    "acr-23": "acr-23 encodes an alpha 7-like homomer-forming subunit of the nicotinic acetylcholine receptor (nAChR) superfamily which encode ligand-gated ion channels that regulate fast action of acetylcholine at neuromuscular junctions and in the nervous system; ACR-23 is a member of the DEG-3-like group of nAChR subunits which appears to be unique to nematodes.",
    "add-1": "add-1 encodes an ortholog of the cytoskeletal protein alpha-adducin (ADD1, OMIM:102680, mutations are associated with susceptibility to salt-sensitive essential hypertension); by homology, ADD-1 is predicted to be a cell membrane-associated protein that mediates localized changes in the cytoskeleton in response to activation of signal transduction cascades; in C. elegans, ADD-1 activity is required for short- and long-term memory, specifically for regulation of actin cytoskeleton organization and regulation of GLR-1 ionotropic glutamate receptor dynamics in the AVA command interneuron; RNAi experiments have also shown that add-1 activity is required for effective transgene-induced co-suppression in the germline; add-1 is expressed in the nervous system, intestinal and rectal epithelia, seam cells and coelomocytes; in the ventral nerve cord, ADD-1 co-localizes to the post-synaptic density with GLR-1.",
    "age-1": "age-1 encodes the C. elegans ortholog of the phosphoinositide 3-kinase (PI3K) p110 catalytic subunit; AGE-1, supplied maternally and embryonically, is a central component of the C. elegans insulin-like signaling pathway, lying downstream of the DAF-2/insulin receptor and upstream of both the PDK-1 and AKT-1/AKT-2 kinases and the DAF-16 forkhead type transcription factor, whose negative regulation is the key output of the insulin signaling pathway; in accordance with its role in insulin signaling, AGE-1 activity is required for regulation of metabolism, life span, dauer formation, stress resistance, salt chemotaxis learning, fertility, and embryonic development; although the age-1 expression pattern has not yet been reported, ectopic expression studies indicate that pan-neuronal age-1 expression is sufficient to rescue life-span defects, while neuronal, intestinal, or muscle expression can partially rescue dauer formation, and neuronal or muscle expression can rescue metabolic defects.",
    "aha-1": "aha-1 encodes an ortholog of human aryl-hydrocarbon receptor nuclear translocator; AHA-1 interacts with AHR-1 and HIF-1 in vitro, requires HIF-1 for proper localization, and is expressed ubiquitously; AHA-1 also physically interacts with CKY-1, and when co-expressed in vitro, an AHA-1/CKY-1 complex exhibits sequence-specific DNA binding; when co-expressed in cultured cells, the AHA-1/CKY-1 complex can stimulate reporter gene transcription;",
    "ahr-1": "ahr-1 encodes an aryl hydrocarbon receptor (ligand-activated basic helix-loop-helix transcription factor) ortholog that biochemically resembles its vertebrate relatives (OMIM:600253) which mediate the carcinogenic and teratogenic effects of environmental toxins; AHR-1 activity is required for specification of RMEL and RMER GABAergic neuron cell fate and negative regulation of spontaneous movement; AHR-1 binds HSP90 tightly, and forms a dimer with AHA-1 that binds DNA fragments containing the mammalian xenobiotic response element; AHR-1 is expressed in neurons.",
    "alr-1": "alr-1 encodes a homeodomain transcription factor orthologous to aristaless/human Arx; alr-1 regulates the development of sensory neurons in the head and GABAergic motor neurons; ALR-1 affects touch receptor neuron (TRN) fate by acting as a transcriptional activator and is  required selectively for TRN gene expression; alr-1 expression in TRNs depends on MEC-3; ALR-1 ensures TRN differentiation by providing a second positive feedback circuit to maintain mec-3 expression; loss of alr-1 produces variable touch sensation; alr-1 increases mec-3 expression by restricting mec-3 expression variability; alr-1 activity is needed throughout larval development; alr-1 is expressed in the ALM, PLM, and AVM TRNs, but not in the nucleus of PVM throughout all larval development.",
    "arr-1": "arr-1 encodes the C. elegans beta-arrestin ortholog (OMIM:107940, 107941, mice lacking beta-arrestin family members display defects in G protein-coupled receptor desensitization); by homology, ARR-1 is predicted to be a multifunctional adaptor protein that interacts with intracellular signaling molecules as well as activated and phosphorylated G protein-coupled and TGF-beta receptors to: 1) downregulate receptor signaling, 2) promote receptor endocytosis, and 3) activate MAP kinase- and Src-dependent signaling pathways; in vivo, arr-1 activity is required for normal egg laying and for proper olfactory adaptation and recovery to volatile odorants; in addition, animals doubly mutant for arr-1 and grk-2, which encodes a G protein-coupled receptor kinase, are sick and slow growing; ARR-1 is detected throughout the nervous system and is highly expressed in the amphid chemosensory neurons; in neuronal cells, ARR-1 appears to be largely cytoplasmic; ARR-1 interacts physically with clathrin and beta2-adaptin, two proteins involved in receptor endocytosis.",
    "atat-2": "atat-2 encodes an alpha-tubulin acetyltransferase; atat-2 functions redundantly with its paralog, MEC-17, for acetylation of K40 on MEC-12 alpha-tubulin, an alpha-tubulin enriched in the touch receptor neurons.",
    "cam-1": "cam-1 encodes a receptor tyrosine kinase of the immunoglobulin superfamily that is orthologous to human ROR1 (OMIM:602336) and ROR2 (OMIM:602337, mutation of which leads to type B brachydactyly); cam-1 is required for locomotion, cell migration, asymmetric cell division, axon outgrowth, and dauer formation; CAM-1, along with LIN-17, CWN-2, and DSH-1, functions as part of a Wnt signaling pathway that regulates ACR-16 localization to postsynaptic regions, a key component of activity-dependent synaptic plasticity; CAM-1 is broadly expressed during embryogenesis and larval development with expression first appearing at the 200-cell stage of embryogenesis; in muscle arms, CAM-1 colocalizes with LIN-17.",
    "cct-2": "cct-2 encodes a putative beta subunit of the eukaryotic cytosolic ('T  complex') chaperonin, orthologous to human CCT2 (OMIM:605139); CCT-2 is  expressed in most, if not all, tissues; CCT-2 represses SKN-1-dependent  transcription of gst-4; CCT-2 is expressed in touch receptor neurons in  a MEC-3-dependent fashion; in mass RNAi assays, CCT-2 is required for  normal transgene repression and subcellular localization, embryonic  osmotic integrity, embryonic and larval viability, fertility, vulval  development, and body color.",
    "ceh-37": "ceh-37 encodes one of three C. elegans proteins with an OTX-like homeodomain; however, CEH-37 lacks other domains found in OTX proteins, and the CEH-37 homeodomain is predicted to resemble the Myb domain of telomere-binding proteins; CEH-37 binds the telomeric sequence 'TTAGGC' if it is repeated at least 1.5 times, and is mainly localized to the telomere in vivo; ceh-37 mutants have a weak increase in chromosomal nondisjunction; CEH-37 is involved in specifying some aspects of the AWB olfactory neuron fate, such as expression of an AWB-specific odorant receptor and a LIM-class homeodomain protein, LIM-4; CEH-37 is expressed broadly in the early embryo, while in larvae and adults it is expressed solely in the excretory cell.",
    "ckr-2": "Y39A3B.5 encodes a seven transmembrane receptor that is most closely related to the mammalian cholecystokinin receptors; loss of Y39A3B.5 activity via RNAi, either singly or in combination with another cholecystokinin receptor-encoding gene, T23B3.4, has no effect on fat metabolism.",
    "cni-1": "cni-1 encodes an ortholog of human cornichon family AMPA receptor auxiliary protein 1 (HGNC:CNIH1); cni-1 is localized to the endoplasmic reticulum and the synapse.",
    "cog-1": "cog-1 encodes the C. elegans ortholog of the vertebrate Nkx6 homeodomain proteins; cog-1 activity is required for multiple aspects of reproductive system development, including connection of uterus to the vulva and vulval cell specification, as well as for specification of left/right asymmetry in the ASE taste receptor sensory neurons where cog-1 acts in ASER to suppress the ASEL cell fate; cog-1 expression in ASEL is negatively regulated by the lsy-6 miRNA; a cog-1::gfp reporter fusion is expressed in neurons and in the hermaphrodite vulva and uterus; in males, cog-1::gfp expression is seen in proctodeal cells and occasionally in the rectal Rep cells and P11.pp progeny.",
    "daf-1": "daf-1 encodes a TGF-beta type I receptor homolog required, in association with the TGF beta-like type II receptor DAF-4, for the regulation of dauer formation by environmental signals through the ASI chemosensory neuron; DAF-1 is bound by BRA-1 and has an intracellular serine-threonine kinase domain; mutations in daf-1 result in constitutive formation of dauer larvae even in abundant food; DAF-1 is broadly expressed, but expression in the RIM/RIC interneurons mediates development, pathogen avoidance behavior, feeding rate, and quiescence.",
    "daf-2": "daf-2 encodes a receptor tyrosine kinase that is the C. elegans insulin/IGF receptor ortholog; DAF-2 activity is required for a number of processes in C. elegans, including embryonic and larval development, formation of the developmentally arrested dauer larval stage (diapause), larval developmental timing, adult longevity, reproduction, fat storage, salt chemotaxis learning, and stress resistance, including response to high temperature, oxidative stress, and bacterial infection; DAF-2 signals through a conserved PI 3-kinase pathway to negatively regulate the activity of DAF-16, a Forkhead-related transcription factor, by inducing its phosphorylation and nuclear exclusion; in addition, DAF-2 negatively regulates the nuclear localization, and hence transcriptional activity, of SKN-1 in intestinal nuclei; amongst the 38 predicted insulin-like molecules in C. elegans, genetic and microarray analyses suggest that at least DAF-28, INS-1, and INS-7 are likely DAF-2 ligands; genetic mosaic and tissue-specific promoter studies indicate that daf-2 can function cell nonautonomously and within multiple cell types to influence dauer formation and adult lifespan, likely by regulating the production of secondary endocrine signals that coordinate growth and longevity throughout the animal; temporal analysis of daf-2 function indicates that daf-2 regulates lifespan, reproduction, and diapause independently, at distinct times during the animal's life cycle.",
    "daf-37": "daf-37 encodes a G-protein coupled receptor (GPCR) that belongs to the serpentine receptor class w (Srw) family of chemoreceptors; daf-37 functions in dauer signaling, upstream of the daf-11/guanylyl cyclase, daf-7/TGF-beta, and daf-2/insulin signaling pathways; daf-37 specifically senses and binds to a ascaroside (ascr#2), ascarosides are the major small-molecule components of the dauer pheromone and control developmental diapause (dauer), olfactory learning, social behavior and lifespan; cell-specific overexpression studies indicate that DAF-37 regulates dauer when expressed in ASI neurons and adult behavior when expressed in ASK neurons; daf-37 heterodimerizes with daf-38 (a GPCR with homology to human gonadotropin-releasing hormone receptor that participates in perception of ascr#2 as well as other ascarosides), most likely to form a functional receptor complex; daf-37 and daf-38 are expressed in chemosensory neurons.",
    "daf-38": "daf-38 encodes a G-protein coupled receptor (GPCR) with homology to human gonadotropin-releasing hormone receptor; daf-38 participates in perception of ascr#2 as well as other ascarosides, which are the major small-molecule components of the dauer pheromone and control developmental diapause (dauer), olfactory learning, social behavior and lifespan;  daf-38 forms a  heterodimer with daf-37 (a GPCR that belongs to the serpentine receptor class w (Srw) family of chemoreceptors) that also participates in perception of the ascaroside, ascr#2), most likely to form a functional receptor complex; daf-38 and daf-37 are expressed in chemosensory neurons.",
    "daf-4": "daf-4 encodes a transmembrane serine/threonine kinase that is the sole C. elegans ortholog of the type II transforming growth factor-beta (TGF-b) receptors; DAF-4 activity is required for several biological processes, including entry into and exit from the dauer larval stage, body size determination, male tail patterning, egg laying, chemosensory neuron specification, and increased thermotolerance; in regulating dauer larval development, DAF-4 acts in parallel with the insulin signaling pathway and likely partners with the DAF-1 type I TGF-b receptor to receive a signal from the DAF-7 TGF-b ligand; in body size determination and male tail patterning, DAF-4 likely partners with the SMA-6 type I receptor and responds to signals from the DBL-1 ligand; thus daf-4 is utilized by both the Dauer TGF-beta pathway and the TGF-beta Sma/Mab pathway; daf-4 also regulates reproductive aging, via the TGF-beta Sma/Mab pathway, mutants of which show a large reproductive span extension; DAF-4 expression begins in late embryogenesis and continues through larval and adult stages; consistent with its role in many developmental processes, DAF-4 localizes to the plasma membrane of several tissues including head and tail neurons, the pharynx, intestine, ventral nerve cord, tail hypodermis, and body wall muscle.",
    "daf-9": "daf-9 encodes a cytochrome P450 of the CYP2 subfamily that by homology is predicted to function as a steroidogenic or fatty acid hydroxylase; DAF-9 likely functions cell nonautonomously in hypodermal and neuronal cells to produce, for the DAF-12 nuclear receptor, a lipophilic hormone whose presence is necessary for bypassing entry into the alternative L3/dauer larval stage and promoting reproductive development; in regulating dauer formation, daf-9 acts downstream of the DAF-2/insulin/IGF receptor and the DAF-7/TGFbeta ligand, suggesting that at least two of the signaling pathways that control dauer formation converge, in part, upon daf-9; in addition, daf-9 activity is required for gonadal cell migration; a DAF-9::GFP fusion is expressed in the XXXL/R head cells at all developmental stages, in hypodermal cells from the L2 to L4 larval stages, and in the spermatheca of adult hermaphrodites.",
    "dcar-1": "dcar-1 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "deg-3": "deg-3 encodes an alpha subunit of a nicotinic acetylcholine receptor (nAChR); originally defined by a gain-of-function mutation that results in neuronal degeneration and uncoordinated movement, DEG-3 can form heteromeric channels with a second alpha subunit, DES-2, and in vivo these channels appear to be required for chemosensation of choline; deg-3 and des-2 reside in an operon, and consistent with their role in metabolite chemosensation, are expressed in nonsynaptic regions such as the sensory endings of the IL2 chemosensory neurons; DEG-3 and DES-2 are also detected in the touch cell neurons, M1 head muscles, FLP and PVD sensory neurons, and the PVC interneuron; in subsets of these neurons, DEG-3 expression is not detectable in mec-3 or unc-86 mutant backgrounds.",
    "des-2": "des-2 encodes an alpha subunit of nicotinic acetylcholine receptor (nAChR), predicted to be a ligand-gated ion channel regulating the fast action of acetylcholine at neuromuscular junctions and in the nervous system; DES-2 is coexpressed with and genetically interacts with DEG-3, which which it probably forms heteromultimers, and DES-2 falls into the 'DEG-3' class of nAChR subunits, probably unique to nematodes, which includes DEG-3, ACR-5, ACR-17, ACR-18 ACR-20, and ACR-23.",
    "dop-1": "dop-1 encodes a D1-like dopamine receptor; dop-1 is required cell autonomously in the touch neurons for modulation of mechanosensory behaviors such as tap habituation; in addition, dop-1 is required for regulation of locomotion via antagonism of the DOP-3 D2-like dopamine receptor in cholinergic neurons; when expressed in tissue culture cells, DOP-1 activity is stimulated by dopamine and to a lesser extent, by norepinephrine and epinephrine; when coexpressed with bovine or C. elegans GalphaS, DOP-1 stimulates potassium channel activity; DOP-1 is expressed in several different types of cells including mechanosensory neurons, cholinergic motor neurons, interneurons, excretory gland cells, head muscles, and neuronal support cells; DOP-1 localizes to the plasma membrane; dop-1 expression in the RIS interneuron is regulated by the LIM-6 homeodomain protein.",
    "dop-4": "dop-4 encodes an ortholog of human adrenoceptor alpha 1A (HGNC:ADRA1A); dop-4 is involved in adenylate cyclase-activating dopamine receptor signaling pathway; dop-4 exhibits dopamine neurotransmitter receptor activity; and dop-4 is localized to the postsynaptic membrane.",
    "egl-46": "egl-46 encodes a transcription factor with similarity to the TFIIA-like zinc-finger protein family; egl-46 activity is required for coordinated locomotion, morphology and process formation of the touch cells, male mating efficiency, HSN cell migration, differentiation, and axonal outgrowth, serotonin production and also terminal divisions of the Q neuroblasts; egl-46 acts to inhibit touch cell fate in FLP cells together with egl-44; EGL-46 is a nuclear protein expressed dynamically in neurons, including the touch receptor neurons, ventral cord neurons, FLP, and HSN neurons; egl-46 expression in FLP cells, but not HSN cells, is dependent upon EGL-44.",
    "egl-6": "egl-6 encodes a G protein-coupled receptor; EGL-6 functions as a receptor for FMRFamide-related peptides that inhibit activity of the HSN motor neurons; an EGL-6::GFP reporter fusion is expressed primarily in the HSN neurons and the GLR glia-like cells in the head.",
    "eor-1": "eor-1 encodes an ortholog of the human BTB/zinc-finger transcription factor PLZF (OMIM:176797), which is is found as a retinoic acid receptor alpha (RARA) fusion in acute promyelocytic leukemia (APL); EOR-1 positively regulates RAS/RAF-mediated signalling during excretory system development, as well as RAS/RAF- and WNT-mediated signalling during P12 fate specification; EOR-1 may function with EOR-2 and Hox genes to control the expression of Ras- and Wnt-responsive genes.",
    "erm-1": "erm-1 encodes the C. elegans ortholog of the ERM (Ezrin, Radixin, Moesin) family of cytoskeletal linkers; ERM-1 activity is required for regulating LET-23/EGFR receptor localization in the vulval cell lineages to effect proper temporal regulation of Ras-mediated EGF signaling.",
    "fax-1": "fax-1 encodes a conserved nuclear receptor that contains two C4-type zinc fingers and is orthologous to the vertebrate photoreceptor-specific nuclear receptor PNR (OMIM:604485, mutated in enhanced S-cone syndrome and retinitis pigmentosa); fax-1 is required for normal locomotion and neuron fate specification, including specification of the AVA, AVE, and AVK interneurons and proper axon pathfinding of the AVK, HSNL, and PVQL axons; expression of reporter gene fusions in fax-1 mutants suggests that fax-1 functions by regulating expression of a number of downstream targets, including nmr-1 and nmr-2, opt-3, flp-1, and ncs-1; in some neurons, fax-1 regulates expression combinatorially with unc-42, which encodes a paired-like homeodomain protein that additionally, regulates fax-1 expression in AVK neurons; FAX-1 exhibits sequence-specific DNA binding in vitro and the FAX-1 DNA binding domain, when fused to the GAL4 transcriptional activator, can positively regulate transcription in yeast one-hybrid assays; FAX-1 is expressed in the nuclei of 18 neurons, including the AVK, AVA, AVB, and AVE interneurons, beginning at mid-embryogenesis and continuing through larval and adult stages; FAX-1 is also seen in two non-neuronal cell types: the distal tip cells (DTCs), from L2 to L4 larval stages, and two pairs of vulval cells in L4 animals.",
    "flp-21": "flp-21 encodes a single FMRFamide-related neuropeptide (FaRP) that serves as a ligand for NPR-1, a G protein-coupled receptor that regulates social versus solitary feeding behavior in several Caenorhabditis species; genetic analysis suggests that FLP-21 acts through NPR-1 to inhibit social feeding behavior; FLP-21 is expressed in the ADL, ASE and ASH sensory neurons, the URA motor neurons, the MC, M2 and M4 pharyngeal neurons, and the intestine; flp-21 encodes the only FMRFamide-related neuropeptide (FaRP) encoded by the C. elegans genome that activates both the social (215F) and the solitary (215V) forms of NPR-1 in both Xenopus oocytes and pharyngeal assays.",
    "gab-1": "gab-1 encodes a gamma-aminobutyric acid (GABA) receptor beta-like subunit with both the neurotransmitter-gated ion-channel ligand binding and transmembrane domains; gab-1 can form a GABA-responsive channel when co-expressed with alpha/gamma type subunits in a heterologous expression system; experiments with gab-1 indicate that GABA receptors are involved in the mechanism of resistance to the widely used broad-spectrum anthelmintic drug Ivermectin.",
    "gar-2": "gar-2 encodes a novel, seven transmembrane-domain G protein-coupled acetylcholine receptor (AChR); when expressed in Xenopus oocytes treated with acetylcholine, GAR-2 is able to activate a mammalian G protein-activated inwardly rectifying K+ (GIRK1) channel, but not other channels, suggesting that GAR-2 couples to G proteins of the Gi family; pharmacological analyses indicate, however, that GAR-2 exhibits properties distinct from mammalian muscarinic AChRs; gar-2 is expressed from mid-embryogenesis through adulthood with expression seen in ciliated head neurons, ventral cord neurons, and the HSN (hermaphrodite-specific neuron).",
    "gcy-29": "gcy-29 encodes an ortholog of human natriuretic peptide receptor 2 (HGNC:NPR2); gcy-29 is predicted to have protein kinase activity and phosphorus-oxygen lyase activity, based on protein domain information.",
    "gcy-5": "gcy-5 encodes a predicted guanylate cyclase with strong similarity to rat atrial natriuretic peptide receptor A; expressed in ASER.",
    "ggr-1": "ggr-1 encodes a predicted member of the GABA/ glycine receptor family of ligand-gated chloride channels that affects thermotaxis; expressed in AIB, PVR, PVQ, AVH, and SMDV neurons and in some motor neurons in the ventral cord, and in the egg-laying muscles.",
    "ggr-2": "ggr-2 encodes a predicted member of the GABA/ glycine receptor family of ligand-gated chloride channels that affects thermotaxis; expressed in neurons that include SMDV, SMDD, SIAV, CAN, HSN, DD, and is weakly expressed in the egg-laying muscles.",
    "glp-1": "glp-1 encodes an N-glycosylated transmembrane protein that, along with LIN-12, comprises one of two C. elegans members of the LIN-12/Notch family of receptors; from the N- to the C-terminus, GLP-1 is characterized by ten extracellular EGF-like repeats, three LIN-12/Notch repeats, a CC-linker, a transmembrane domain, a RAM domain, six intracellular ankyrin repeats, and a PEST sequence; in C. elegans, GLP-1 activity is required for cell fate specification in germline and somatic tissues; in the germline, GLP-1, acting as a receptor for the DSL family ligand LAG-2, is essential for mitotic proliferation of germ cells and maintenance of germline stem cells; in somatic tissues, maternally provided GLP-1, acting as a receptor for the DSL family ligand APX-1, is required for inductive interactions that specify the fates of certain embryonic blastomeres; GLP-1 is also required for some later embryonic cell fate decisions, and in these decisions its activity is functionally redundant with that of LIN-12; GLP-1 expression is regulated temporally and spatially via translational control, as GLP-1 mRNA, present ubiquitously in the germline and embryo, yields detectable protein solely in lateral, interior, and endomembranes of distal, mitotic germ cells, and then predominantly in the AB blastomere and its descendants in the early embryo; proper spatial translation of glp-1 mRNA in the embryo is dependent upon genes such as the par genes, that are required for normal anterior-posterior asymmetry in the early embryo; signaling through GLP-1 controls the activity of the downstream Notch pathway components LAG-3 and LAG-1, the latter being predicted to function as part of a transcriptional feedback mechanism that positively regulates GLP-1 expression; signaling through the DNA-binding protein LAG-1 is believed to involve a direct interaction between LAG-1 and the GLP-1 RAM and ankyrin domains",
    "glr-2": "glr-2 encodes an AMPA (non-NMDA)-type ionotropic glutamate receptor subunit; GLR-2 activity is required for mediating the behavioral response to light nose touch and for regulating the frequency with which animals change locomotory direction in response to sensory cues such as food; GLR-2 and GLR-1, a second AMPA-type ionotropic glutamate receptor, can interact to form functional heteromeric channels; GLR-2 is expressed in many neurons, including four of the five pairs of command interneurons that are required for locomotory control.",
    "glr-3": "glr-3 encodes a protein that contains a ligand-gated ion channel domain and a receptor family ligand binding domain with similarity to kainate-selective ionotropic glutamate receptor 2 (human GRIK2); expressed in the RIA neuron.",
    "glr-4": "glr-4 encodes a putative non-NMDA ionotropic glutamate receptor subunit, most closely related to GLR-3 and less so to GLR-7, possibly of the kainate subfamily; glr-4 is expressed in various sensory neurons and interneurons from embyrogenesis onward; glr-4 expression requires UNC-42, as well as CFI-1 in URA cells.",
    "glr-5": "glr-5 encodes a kainate (non-NMDA)-type ionotropic glutamate receptor subunit; GLR-5 activity is required for normal brood sizes, especially at high temperatures; GLR-5 is expressed in neurons.",
    "glr-6": "glr-6 encodes a putative non-NMDA ionotropic glutamate receptor subunit, most closely related to GLR-5, possibly of the kainate subfamily; glr-6 (along with glr-3) is expressed in only one cell type, the thermosensory interneuron RIA, from near hatching onward to adulthood.",
    "glr-8": "glr-8 encodes a highly divergent putative ionotropic glutamate receptor subunit, unclassifiable as NMDA or non-NMDA (though possibly of the Delta subfamily), and without any clear close homologs in metazoa or plants; glr-8 is expressed in the pharyngeal nervous system, the body wall mechanoreceptors ALM and PLM, and two other neurons (BDU and URB); glr-8 is expressed from embryogenesis to adulthood.",
    "gon-14": "gon-14 is involved in muscle contraction, defecation, gonad morphogenesis, multicellular organism growth and regulation of pharyngeal pumping; gon-14 exhibits receptor binding activity and is predicted to have nucleic acid binding activity and protein dimerization activity, based on protein domain information; and gon-14 is localized to the nucleus.",
    "grk-2": "grk-2 encodes a serine/threonine protein kinase that is most closely related to G protein-coupled receptor (GPCR) kinases; in C. elegans, grk-2 activity is required in chemosensory neurons for normal calcium influx during chemosensation, but is not required for GPCR downregulation; in regulating chemosensation, GRK-2 likely acts upstream of the ODR-3/G alpha protein, as overexpression of ODR-3 can rescue abnormal avoidance behavior in grk-2 mutants; GRK-2 is broadly expressed in the adult nervous system, with expression beginning as early as the 20-30-cell stage of embryonic development and continuing into adulthood.",
    "hecw-1": "hecw-1 encodes a conserved HECT domain-containing E3 ubiquitin ligase; HECW-1 activity is required in the OLL sensory neuron pair to negatively regulate pathogen avoidance behavior through inhibition of the neuropeptide receptor NPR-1; hecw-1 is expressed in neurons throughout the body and in the anterior ganglion, is expressed in the OLL left and right neurons.",
    "hen-1": "hen-1 encodes a secreted protein that contains a low-density lipoprotein (LDL) receptor motif A; HEN-1 activity is required for integration of sensory stimuli and behavioral plasticity; a hen-1::GFP reporter is expressed in pharyngeal muscles, the vulva, and weakly in a subset of neurons; antibodies to HEN-1 protein detect expression exclusively in the AIY and ASE neurons, where HEN-1 appears to localize to cell bodies and in a punctate pattern in nerve ring axons at sites of synapse formation; HEN-1 expression in AIY appears to be under the control of the TTX-3 LIM domain transcription factor.",
    "ins-18": "ins-18 encodes one of 40 C. elegans insulin/IGF-like peptides; INS-18, along with INS-1, are the only two C. elegans insulins that contain a C peptide, characteristic of mammalian insulins, connecting the B and A chains; overexpression of ins-18 induces dauer arrest at  26 degrees C and enhances the dauer arrest seen in a daf-2 mutant at 20 degrees C, suggesting that INS-18 functions to antagonize DAF-2 receptor signaling; in addition, daf-7; ins-18 doubly mutant animals show dauer maintenance defects, suggesting that INS-18 activity is required to properly maintain the dauer developmental state; ins-18::gfp reporters are expressed in neurons and the intestine.",
    "itr-1": "itr-1 encodes a putative inositol (1,4,5) trisphosphate receptor that affects the defecation cycle and pharyngeal pumping, and also affects ovulation in a pathway downstream of LET-23; interacts with UNC-54 in vivo, and is expressed in the adult intestine, pharynx, excretory cell, germ line, and spermatheca, with limited neuronal expression.",
    "kqt-1": "kqt-1 encodes one of three C. elegans KCNQ-like potassium channel subunits that, with respect to humans, is most similar to the KCNQ2-5 subfamily of channel proteins; although loss of KQT-1 activity via large-scale RNAi screens results in no obvious abnormalities, KQT-1 likely functions to regulate cellular excitability as expression of KQT-1 in Xenopus oocytes can produce K+ channel currents that functionally resemble vertebrate M-currents; activity of these KQT-1 channels can be suppressed by coexpression with the human M1 muscarinic receptor and treatment with diacylglycerol analogs; a KQT-1::GFP translational fusion is expressed in pharyngeal muscle cells, in the anterior and posterior mechanosensory neurons ALM and PLM, and in some head neurons.",
    "kqt-3": "kqt-3 encodes one of three C. elegans KCNQ-like potassium channel subunits and, with respect to humans, is most similar to the KCNQ1 channel protein which when mutated leads to inherited long QT syndrome (OMIM:607542); although loss of KQT-3 activity via large-scale RNAi screens results in no obvious abnormalities, KQT-3 likely functions to regulate cellular excitability as expression of KQT-3 in Xenopus oocytes can produce K+ channel currents that functionally resemble vertebrate M-currents; activity of these KQT-3 channels can be suppressed by coexpression with the human M1 muscarinic receptor and treatment with diacylglycerol analogs, although KQT-3 is less sensitive to each of these treatments than KQT-1; a KQT-3::GFP fusion protein is expressed in the anterior- and posterior-most intestinal cells, the anterior and posterior mechanosensory neurons ALM and PLM, amphid and phasmid neurons, and in some additional head neurons.",
    "lag-2": "lag-2 encodes a transmembrane protein of the Delta/Serrate/Lag-2 (DSL) family that functions as a signaling ligand for the GLP-1 and LIN-12 Notch-like receptors; LAG-2 is required for larval viability and for cell fate decisions involving the germline (meiosis vs mitosis), the somatic gonad, and the early embryo; in addition, LAG-2 functions redundantly with the transmembrane APX-1 and secreted DSL-1 ligands to regulate lateral signaling during vulval development; LAG-2 is expressed in the distal tip cell of the somatic gonad, the ventral nerve cord, the descendants of ABalap and MSap in the developing embryo, and in all six vulval precursor cells (VPCs) during the early L3 stage, with later expression in the VPCs generally restricted to P6.p; lag-2 expression in the vulval cells is regulated by the LET-23/EGF receptor signaling pathway and the SUR-2 component of the Mediator transcription complex.",
    "lat-1": "lat-1 encodes a seven transmembrane domain receptor that is a member of the adhesion class of G protein-couple receptors (aGPRCs) and the nematode homolog of Latrophilin/CIRL/LPHN/CL; lat-1 is required for embryonic elongation, pharyngeal development, and sperm development and/or function; LAT-1 is expressed in developing epithelia, specifically in left epidermoblasts during dorsal intercalation, and also in pharyngeal muscles and neurons, and in the nerve ring; LAT-1 localizes to the plasma membrane; in the embryo, lat-1 expression overlaps with that of ten-1 in the dorsal left epidermoblasts; as lat-1 and ten-1 also display genetic interactions during embryonic development, the overlapping expression patterns suggest that these two genes have overlapping functions during embryogenesis.",
    "lev-8": "lev-8 encodes a novel nicotinic acetylcholine receptor (nAChR) alpha subunit that is a member of the ACR-8 group of nAChR subunits; LEV-8 activity is required for normal rates of pharyngeal pumping and for fully wild-type responses (increased egg laying and body wall muscle contraction) to the nAChR agonist and antihelmintic levamisole; expression of a LEV-8::GFP reporter construct begins at the L1 larval stage and is detected in neurons, body wall and uterine muscle cells, and socket cells of the IL and OL mechanosensory neurons; expression in body wall muscles is strongest in the anterior, consistent with increased levamisole resistance of head, or anterior, muscles seen in lev-8 mutant animals.",
    "lgc-38": "F11H8.2 encodes an UNC-49-like GABA receptor subunit.",
    "lim-6": "lim-6 encodes a LIM class homeodomain protein that contains two Zinc-finger-like LIM domains N-terminal to a predicted DNA-binding homeodomain; LIM-6 is predicted to function as a transcription factor whose activity is required for regulating uterine morphogenesis and specific aspects of terminal neuronal differentiation, including normal axonal morphology, full expression of UNC-25/glutamic acid decarboxylase in select GABAergic neurons, and repression of sensory receptor gene expression in the ASEL chemosensory neuron; LIM-6 is expressed in a group of nine chemosensory-, inter-, and motorneurons,  uterine toroid cells, spermathecal junction cells, and the binucleate excretory gland cell.",
    "lin-12": "The lin-12 gene encodes a member of the Notch/LIN-12/glp-1 transmembrane receptor family that affects cell fate specification events during development, notably including the anchor cell, secondary vulval precursor cells, and the embryonic ABplp lineage; its expression is dynamic, including Z1.ppp and Z4.aaa, ABplaa descendants, ABplpa descendants, and the intestinal primordium.",
    "lin-17": "lin-17 encodes one of four C. elegans Frizzled homologs, integral membrane proteins that contain an external cysteine rich domain (CRD) and seven transmembrane domains and that function in a wide variety of species as receptors for Wnt glycoprotein signaling molecules; LIN-17 activity is required for specifying the polarity of a number of asymmetric cell divisions that, in C. elegans, are essential for development of such structures as the vulva, somatic gonad, and tail; LIN-17 is also required for the proper polarity of neuronal migrations along the anterior-posterior axis; genetic interactions indicate that LIN-17 likely functions as a receptor for several different Wnt molecules, including LIN-44 and EGL-20, and that in specifying cell fates, the LIN-17-mediated signaling pathway often functions redundantly with other signaling pathways, including the RTK/Ras pathway; LIN-17, along with CWN-2, CAM-1, and DSH-1, functions as part of a Wnt signaling pathway that regulates ACR-16 localization to postsynaptic regions, a key component of activity-dependent synaptic plasticity; a LIN-17 translational reporter fusion shows membrane-associated expression in all of the Pn.pxx vulval precursor cells, in the descendants of V6 and T in males, in the P11.p and B cells, as well as their daughters, and granddaughters, and weakly in P10.p and its daughters; the reporter fusion does not reveal expression in P7.p, Z1, Z4, and T; LIN-17 is also expressed in muscle arms, where it colocalizes with CAM-1.",
    "lin-32": "lin-32 encodes a basic helix-loop-helix transcription factor that is required for development of several types of neurons, including the touch receptor neurons and the male sensory ray neurons.",
    "max-2": "max-2 encodes, by alternative splicing, at least two isoforms of a putative p21-activated kinase that is required (redundantly with its paralog, PAK-1) for normal axonal guidance of motoneurons, P cell migration, and locomotion, with max-2(cy2);pak-1(ok448) double mutants phenotypically resembling unc-73 or ced-10;mig-2 mutants; max-2 is expressed ubiquitously in early embryos, then localizes to the anterior embryo and is expressed in pharynx and head neurons; postembryonically, max-2 seems to be expressed in body wall touch receptors (ALM, PLM, PVD, and PLM), but can rescue max-2 mutations when transgenically expressed in ventral cord motoneurons; by themselves, max-2 mutations have only mild axonal guidance phenotypes and only subtle defects in movement; MAX-2 is required for normal sensitivity to aldicarb; max-2 mutations suppress UNC-5 overexpression phenotypes, and are dominantly enhanced by unc-5 or unc-6 mutations, indicating that MAX-2 functions downstream of the netrin receptor UNC-5.",
    "mbr-1": "mbr-1 encodes an ortholog of human ligand dependent nuclear receptor corepressor-like (HGNC:LCORL); mbr-1 is predicted to have DNA binding activity, based on protein domain information.",
    "mec-1": "mec-1 encodes proteins with multiple disulfide-linked EGF and Kunitz domains; MEC-1 activity is required for normal mechanosensory behavior, and specifically for: 1) localization of the touch receptor degenerin channel complex, 2) accumulation of MEC-5/collagen into the extracellular matrix surrounding touch receptor neurons, and 3) attachment of touch receptor processes to the body wall; mec-1 promoter-GFP fusions indicate that, in addition to the six touch receptors, mec-1 can be expressed in many lateral neurons, the PVT interneuron, and the intestinal muscle; mec-1 expression in the touch receptors is, however, sufficient to rescue touch sensitivity in mec-1 mutant animals; MEC-1 appears to be an extracellular protein that: 1) binds to touch receptor processes uniformly and in a punctate pattern and 2) colocalizes with MEC-5 and degenerin channel puncta on these processes; while localization of MEC-1 into puncta requires the activity of mec-5 and mec-9, uniform MEC-1 localization requires the activity of him-4; in addition, proper organization and distribution of MEC-1, MEC-5, and the degenerin channel complex puncta appears to be regulated by interactions with adjacent epidermal tissue.",
    "mec-12": "mec-12 encodes an alpha-tubulin; MEC-12 is required for normal mechanosensory response to gentle touch, and specifically for formation of the 15-protofilament microtubule bundle present in the touch receptor neurons; mec-12 interacts genetically with mec-5, which encodes a unique C. elegans collagen secreted by the hypodermis; MEC-12 is highly expressed in the touch neurons as well as in several other neurons that do not contains the microfilament bundle, such as the ventral cord motorneurons; MEC-12 is acetylated in a manner that is dependent upon MEC-17 and W06B11.1, which encode paralogous alpha-tubulin acetyltransferases.",
    "mec-17": "mec-17 encodes an alpha-tubulin acetyltransferase; MEC-17 activity is required for maintaining the differentiated state of the touch receptor neurons, and hence the animal's touch sensitivity, during later stages of larval development; MEC-17 and W06B11.1 function redundantly for acetylation of K40 on MEC-12 alpha-tubulin; mec-17 is expressed solely in the touch receptor cells from late embryogenesis through adulthood, and this expression is dependent upon the MEC-3 LIM homeodomain transcription factor; in turn, as MEC-17 is necessary for maintaining differentiated touch receptors, its activity is required for continued expression of MEC-3 and the MEC-7 beta-tubulin.",
    "mec-18": "mec-18 encodes a protein similar to firefly luciferase and plant protein 4-coumarate coA ligase; mec-18 is involved in sensory mechanotransduction; genetic interactions with other mec genes suggest that mec-18 may be involved in negative regulation of the degenerin channel in the touch receptor neurons; mec-18 is expressed exclusively in the touch cells.",
    "mec-7": "mec-7 encodes a beta-tubulin required for touch sensitivity along the body wall, and for normal levels of locomotor activity; it is strongly expressed in six touch receptor neurons, with weak expression in FLP, PVD, and BDU cells.",
    "mec-8": "mec-8 encodes a protein with two RNA recognition motifs (RRM); mec-8 is required for proper development of body wall muscle and chemosensory and touch receptor neurons and as a result, for embryonic and larval development, sensory neuron fasciculation, and mechanosensation; MEC-8 functions as an mRNA processing factor whose activity is required for alternative splicing of genes such as unc-52/perlecan, with which it interacts genetically to produce synthetic lethality at the two-fold stage of embryonic elongation; mec-8 mutations also exhibit synthetic lethality with mutations in a number of other genes, including the sym genes and daf-18; mec-8; unc-52 synthetic lethality is suppressed by mutations in smu-1 and smu-2 which both encode homologs of mammalian spliceosome-associated proteins; mec-8 is broadly expressed in the embryo and expressed in hypodermal and neuronal tissues in larvae.",
    "mec-9": "mec-9 encodes a predicted extracellular protein containing six EGF-like repeats,five Kunitz-type protease inhibitor domains, and a glutamic acid-rich region possibly involved in protein-protein interactions; mec-9 encodes two proteins, only one of which, MEC-9L, appears to be required for normal mechanosensory response to gentle touch and proper functioning of the touch receptor neurons; mec-9 interacts genetically with mec-5, which encodes a unique C. elegans collagen secreted by the hypodermis; MEC-9L is expressed and secreted by the touch receptor neurons.",
    "mgl-1": "mgl-1 encodes a Group II metabotropic glutamate receptor (OMIM:604099, loss-of-function mutations in mice are associated with defects in long-term depression); by homology, MGL-1 is predicted to function as a pre-synaptic G protein-coupled receptor that, in response to glutamate binding, inhibits adenylyl cyclase activity; loss of mgl-1 activity reduces the excess fat of daf-7 mutants, indicating that mgl-1 plays a role in regulation of fat accumulation; in addition, loss of mgl-1 activity via large-scale RNAi screens indicates that, in C. elegans, MGL-1 is required for normal post-embryonic growth rates; an mgl-1::GFP reporter is expressed in interneurons, motor neurons, and pharyngeal neurons.",
    "mig-13": "mig-13 encodes a novel single-pass transmembrane protein with a N-terminal signal sequence and two motifs that have been implicated in protein-protein interactions: a CUB domain and a LDL receptor repeat; mig-13 affects the migration and thus the positioning of the Q neuroblasts and their descendants and also the anterior migration of the BDU neuron and may be a component of a global anterior/posterior migration system; a mig-13-gfp translational fusion protein is expressed in embryonic pharyngeal, hypodermal and anterior body neuronal precursors as well as in the cell bodies and axons of a number of neurons in the retrovascular ganglion and the ventral cord; mig-13 localizes to the plasma membrane;          mig-13 expression along the A/P axis is restricted by hox gene activity.",
    "mks-5": "mks-5 encodes an ortholog of human RPGRIP1-like (HGNC:RPGRIP1L); mks-5 is involved in receptor localization to nonmotile primary cilium; and mks-5 is localized to the ciliary transition zone.",
    "mpz-1": "mpz-1 encodes a multi-PDZ domain scaffold protein; mpz-1(RNAi) animals have reduced serotonin (5-HT)-stimulated egg laying unless truncated SER-1 is transgenically expressed in vulval muscle; overexpressed MPZ-1 PDZ domain 10 also reduces SER-1-mediated egg laying; the PDZ domain 10 of MPZ-1 binds the C-terminal PDZ-binding motif (ETFL) of the 5-HT receptor SER-1; MPZ-1 also physically interacts with the RHGF-2 RhoGEF, and may also bind NPR-1 and ZC84.4; MPZ-1 binding enhances SER-1 activity; mpz-1 is expressed in the nerve ring, pharyngeal, body, and tail neurons, as well as body wall and vulval muscles; mpz-1 is coexpressed with ser-1 in three neuron types and vulval muscle; MPZ-1 co-localizes with SNB-1 in neuronal puncta and with RHGF-2 in nerve ring axons; mpz-1 may be translationally regulated by a small upstream open reading frame (uORF).",
    "mtd-1": "mtd-1 encodes a novel protein, with an N-terminal extracellular domain and a C-terminal transmembrane domain, that is expressed in touch receptor neurons; loss of mtd-1 function (by either RNAi or a deletion mutation) has no obvious phenotype alone, but specifically enhances touch insensitivity of the temperature-sensitive mec-6(u247).",
    "nhr-111": "nhr-111 encodes a member of the nuclear receptor superfamily; by homology, NHR-111 is predicted to function as a ligand-dependent transcriptional regulator, but as loss of nhr-111 activity via large-scale RNAi screens does not result in any abnormalities, the precise role of NHR-111 in C. elegans development and/or behavior is not yet known; an nhr-111 reporter construct is expressed in embryos and early larvae in a pair of neurons in the ventral ganglion of the head and in two cells that may be the somatic gonad precursors.",
    "nhr-22": "nhr-22 encodes an ortholog of human hepatocyte nuclear factor 4, alpha (HGNC:HNF4A); nhr-22 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nhr-253": "nhr-253 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nhr-36": "nhr-36 encodes an ortholog of human hepatocyte nuclear factor 4, alpha (HGNC:HNF4A); nhr-36 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nhr-38": "nhr-38 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nhr-50": "nhr-50 encodes an ortholog of human nuclear receptor 4A2 (HGNC:NR4A2); nhr-50 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nhr-60": "nhr-60 encodes a nuclear hormone receptor required for seam cell  development, and for embryonic and early larval viability; NHR-60 has no  obvious non-nematode orthologs, and is thus classified as  'supplementary'; NHR-60 is expressed throughout development in most  cells from one-cell embryos to adults, and is noticeably enriched in  seam cells and germline; NHR-60's germline enrichment suggests that it  is maternally contributed to oocytes; subcellularly, NHR-60 is localized  to the nuclear periphery; nhr-60 is transcribed in embryonic seam cell  precursors, and in larval seam cells, pharyngeal gland cells, and  uterine vulval uv1 cells; NHR-23 is required for nhr-60 transcription in  seam cells but not in pharynx; a dominant-negative NHR-60 isoform  displaces endogeneous NHR-60 from the nuclear periphery.",
    "nhr-62": "nhr-62 encodes an ortholog of human hepatocyte nuclear factor 4, alpha (HGNC:HNF4A); nhr-62 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nhr-67": "nhr-67 encodes a nuclear receptor that is orthologous to Drosophila and vertebrate tailless hormone receptors; during development, nhr-67 plays an essential role in larval development and also functions as part of a complex regulatory network that regulates vulval patterning and differentiation and thus, egg laying; specifically, nhr-67 functions to positively regulate gene expression in the vulA, vulD, and vulF cells and negatively regulate gene expression in vulE and vulF; in regulating vulval gene expression, nhr-67 functions together with other transcription factors, including egl-38, lin-11, and cog-1; NHR-67 exhibits sequence-specific DNA binding in vitro and the NHR-67 DNA binding domain, when fused to the GAL4 transcriptional activator, can positively regulate transcription in yeast one-hybrid assays; nhr-67 reporter fusion constructs are expressed dynamically in multiple vulval cell types as well as in head neurons, the hyp7 syncytium, late-stage embryos, the male tail, the anchor cell, and the linker cell.",
    "nhr-68": "nhr-68 encodes an ortholog of human hepatocyte nuclear factor 4, gamma (HGNC:HNF4G); nhr-68 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nhr-69": "nhr-69 encodes a conserved nuclear receptor that is a member of the NR2 subfamily of nuclear receptors that contains Drosophila and human HNF4 (OMIM:600281, mutations in human HNF4A are associated with Type I MODY (maturity-onset diabetes of the young)); by homology, NHR-69 is predicted to function as a transcription factor that may activate or repress transcription in response to a hormonal signal; nhr-69 is expressed strongly in the gut and hypodermis at all stages and is detected in the uterus during the late L4 and adult stages; nhr-69 expression is also occasionally detected in the rectal epithelia and posterior pharynx.",
    "nhr-79": "nhr-79 encodes an ortholog of human hepatocyte nuclear factor 4, alpha (HGNC:HNF4A); nhr-79 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nhr-83": "nhr-83 encodes an ortholog of human hepatocyte nuclear factor 4, alpha (HGNC:HNF4A); nhr-83 is predicted to have sequence-specific DNA binding transcription factor activity, steroid hormone receptor activity, zinc ion binding activity, and sequence-specific DNA binding activity, based on protein domain information.",
    "nmr-1": "nmr-1 encodes an NMDA-type ionotropic glutamate receptor subunit that affects the duration of forward movement which is important during foraging behavior, and also affects osmotic avoidance; the slow kinetics typical of NMDA-dependent currents are likely important for its effect on forward movement.",
    "nmr-2": "nmr-2 encodes an ionotropic glutamate receptor (iGluR) subunit that is most similar to members of the NR2A subfamily of the NMDA class of iGluRs; genetic analysis indicates that nmr-2 is required for full memory retention of a learned avoidance behavior, namely avoidance of NaCl after starvation conditioning; in addition, NMR-2 activity is required for NMDA-gated currents in the AVA interneuron; an NMR-2::GFP fusion protein is expressed in the AVA, AVD, AVE, RIM, AVG, and PVC interneurons beginning at the  three-fold stage of embryogenesis; NMR-2::GFP expression is coincident with that of NMR-1, a second C. elegans NMDA-type ionotropic glutamate receptor subunit also required for memory retention; nmr-2 expression in AVA and AVE is positively regulated by the FAX-1 nuclear receptor.",
    "npr-1": "npr-1 encodes a predicted G protein-coupled neuropeptide receptor that is homologous to the mammalian neuropeptide Y (NPY) receptor (OMIM:162641) required for regulating anxiety, food consumption, and pain sensation; in C. elegans, NPR-1 is involved in ethological variations of social behavior such as social versus solitary feeding; in regulating social behavior, NPR-1 functions as a receptor for the FLP-18 and FLP-21 peptide ligands; NPR-1 also affects some aspect of UNC-6/netrin-mediated branching of motor neurons, as strong npr-1 mutations can suppress abnormal migration of ventral nerve cord neurons induced by overexpression of UNC-6 lacking domain C; NPR-1 is expressed predominantly in the nervous system, and particularly in the AQR, PQR, and URX neurons that are exposed to the body fluid.",
    "npr-14": "npr-14 encodes an ortholog of human hypocretin (orexin) receptor 2 (HGNC:HCRTR2); npr-14 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "npr-15": "npr-15 encodes an ortholog of human bombesin-like receptor 3 (HGNC:BRS3); npr-15 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "npr-18": "npr-18 encodes an ortholog of human melanin-concentrating hormone receptor 1 (HGNC:MCHR1); npr-18 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "npr-35": "npr-35 encodes an ortholog of human neuropeptide FF receptor 2 (HGNC:NPFFR2); npr-35 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "npr-4": "npr-4 encodes an ortholog of human prolactin releasing hormone receptor (HGNC:PRLHR); npr-4 is predicted to have neuropeptide Y receptor activity, based on protein domain information.",
    "npr-5": "Y58G8A.4 encodes, by alternative splicing, two isoforms of a receptor  activated by FLP-18; in cell culture, Y58G8A.4 is bound and activated by  FLP-18 peptides with nanomolar affinity, and acts primarily through  Gq-alpha signalling in vitro (i.e., probably through EGL-30 in vivo);  Y58G8A.4 is paralogous to NPR-1 (and many other C. elegans receptors),  and homologous to the mammalian neuropeptide Y (NPY) receptor  (OMIM:162641) required for regulating anxiety, food consumption, and  pain sensation; other neuropeptides from Ascaris suum (AF3, AF4, and  AF20), which share a C-terminal sequence with FLP-18, also activate  Y58G8A.4; Y58G8A.4 has no obvious phenotype in mass RNAi assays.",
    "npr-9": "npr-9 encodes an ortholog of human galanin receptor 2 (HGNC:GALR2); npr-9 is involved in lipid storage; and npr-9 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "ntr-2": "ntr-2 encodes an ortholog of human arginine vasopressin receptor 1A (HGNC:AVPR1A); ntr-2 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "ocr-1": "ocr-1 encodes a transient receptor potential (TRP) channel; an OCR-1::GFP reporter fusion is expressed in the amphid sensory neurons AWA and ADL.",
    "ocr-2": "ocr-2 encodes a TRPV (transient receptor potential channel, vanilloid subfamily) ion channel; OCR-2 activity is required for several types of sensory transduction including olfaction, osmosensation, mechanosensation, and chemosensation; an OCR-2 fusion protein is expressed in sensory cilia and requires the OSM-9 TRPV channel protein for proper localization; likewise, OSM-9 requires OCR-2 for its cilial localization.",
    "ocr-4": "ocr-4 encodes a transient receptor potential (TRP) channel; an ocr-4::gfp reporter fusion is expressed in the four mechanosensory OLQ neurons.",
    "odr-10": "odr-10 encodes a seven transmembrane G protein-coupled olfactory receptor; ODR-10 activity is required, in the AWA neurons, for the attractive response to low concentrations of diacetyl; ODR-10 is strongly expressed in the cilia of the AWA olfactory neurons and, at low levels, in the CEP neurons; expression of odr-10 mRNA and of an odr-10::GFP fusion gene is greatly reduced in odr-7 mutant animals, suggesting that odr-7, which encodes a nuclear receptor transcription factor, functions upstream of odr-10 in specifying AWA neuronal cell fate.",
    "odr-7": "odr-7 encodes an olfactory-specific member of the nuclear receptor superfamily that affects chemotaxis to some volatile odorants and the cell fate of the AWA olfactory neurons; ODR-7 is expressed in the AWA neurons; in specifying the identity of the AWA neurons, ODR-7 appears to lie upstream of odr-10, which encodes a seven transmembrane domain olfactory receptor that is required for the response to diacetyl, an odorant detected by the AWA neurons.",
    "odr-8": "odr-8 encodes the C. elegans ortholog of Ufm1-specific protease 2 (UfSP2); ODR-8 activity is required cell-autonomously for localization of a subset of G protein-coupled receptors (GPCRs), including ODR-10, by a Ufm1-independent mechanism; in regulating receptor localization, ODR-8 appears to function at an early step in GPCR trafficking; consequently, odr-8 mutant animals display defects in odortaxis, aggregation behavior, and responses to oxygen; ODR-8 physically interacts with ODR-4 to form a complex at the endoplasmic reticulum membrane; odr-8 is expressed in twelve chemosensory neurons: the ten amphid neurons and two phasmid neurons; odr-8 expression overlaps that of odr-4.",
    "oig-1": "oig-1 encodes an ortholog of human protein tyrosine phosphatase, receptor type, D (HGNC:PTPRD).",
    "paqr-1": "paqr-1 encodes an ortholog of human adiponectin receptor 1 (HGNC:ADIPOR1).",
    "paqr-2": "paqr-2 encodes an ortholog of human adiponectin receptor 2 (HGNC:ADIPOR2); paqr-2 is localized to the plasma membrane.",
    "pdfr-1": "pdfr-1 encodes, by alternative splicing, three isoforms of a  G-protein-coupled receptor (GPCR) required for normal locomotion; PDFR-1  is orthologous to Drosophila pigment dispersing factor (PDF) receptors,  and to human CALCR (OMIM:114131, associated with susceptibility to  osteoporesis); pdfr-1 is expressed in all body wall muscles and many  head and tail neurons; the C. elegans neuropeptides PDF-1a, PDF-1b, or  PDF-2 (orthologous to Drosophila PDF) activated PDFR-1 receptors with  dose-dependent nanomolar potency; in vivo, excess PDF-2 induces a  movement phenotype like that seen in a pdf-1 null mutant, indicating  that PDF-1a/b and PDF-2 exert opposite effects on PDFR-1.",
    "plx-1": "plx-1 encodes a C. elegans plexin ortholog; by homology, PLX-1 is predicted to function as a semaphorin receptor whose activity is required for proper positioning of the ray 1 cells in the male tail; genetic analyses indicate that while plx-1 functions in the same genetic pathway as the smp-1 and smp-2 semaphorin-encoding genes to position ray 1 cells, it functions in parallel to unc-73/GEF and the ced-10, mig-2, and rho-1 GTPase genes in affecting ray 1 position; plx-1 reporter gene fusions are expressed in all body wall muscles, male sex-specific muscles, and lateral hypodermal cells during postembryonic development; in the male tail, during the L3 larval stage when ray 1 cells are positioned, the plx-1 reporter is expressed predominantly in cells of the ray 1 and ray 2 lineages, with weaker and transient expression visible in the more posterior 3-9 rays.",
    "sax-7": "sax-7 encodes an ortholog of human L1CAM, and a paralog of lad-2; L1CAM is a member of the group of highly conserved transmembrane cell adhesion receptor molecules which belong to the immunuglobulin superfamily; SAX-7 is required for axon guidance, neurite outgrowth and maintenance of neuronal positioning through homophilic and heterophilic interactions; sax-7 also affects germline development, embryonic morphogenesis, gonadal morphogenesis and tissue attachment; SAX-7 function is regulated by its physical interaction with the ankyrin UNC-44, and the gamma-syntrophin STN-2; nonphosphorylated SAX-7 is ubiquitously expressed at  sites of cell-cell contact and colocalizes with UNC-44.",
    "scd-2": "scd-2 encodes the homolog of the anaplastic lymphoma kinase (ALK) receptor tyrosine kinase (RTK) (OMIM:105590, involved in the development of non-Hodgkin's lymphoma in humans); the ALK family of receptor tyrosine kinases belong to the insulin receptor superfamily; scd-2 was initially identified in a naturally occuring desert oasis strain of C. elegans that fails to respond to the dauer pheromone at 25 degrees centigrade, but does so at a higher temperature; genetic interactions of scd-2 with several genes in the TGF-beta pathway including daf-7, daf-8 and daf-4 indicate that scd-2 acts in parallel to or converges with this pathway to regulate dauer formation via activation of the daf-3 transcription factor; further, genetic interaction studies indicate that the genes hen-1 (ortholog of the ALK ligand), soc-1 (RTK multi-adaptor protein related to DOS/Gab) and sma-5 (similar to human ERK5/MAP kinase 7) act along with scd-2 RTK in a chemosensory transduction pathway that converges with the TGF-beta pathway to affect the dauer decision.",
    "ser-6": "ser-6 encodes a G protein-coupled receptor that is a member of the C. elegans biogenic amine (dopamine, serotonin, octopamine and tyramine) receptor family; in C. elegans, SER-6 functions as part of a signaling pathway that mediates serotonin-induced fat reduction via transcriptional regulation of lipid oxidation genes; a ser-6::GFP promoter fusion is expressed in a subset of head and tail neurons.",
    "smp-2": "smp-2 is predicted to have receptor activity, based on protein domain information.",
    "spsb-1": "spsb-1 encodes an ortholog of human splA/ryanodine receptor domain and SOCS box containing 4 (HGNC:SPSB4).",
    "sra-10": "sra-10 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "sra-17": "sra-17 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "sra-39": "Serpentine receptor class alpha-39",
    "sra-7": "sra-7 encodes a seven transmembrane receptor predicted to function as a G protein-coupled chemosensory receptor; an SRA-7::GFP fusion protein is expressed in the ASK amphid sensory neurons.",
    "sra-9": "sra-9 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "srab-1": "7TM GPCR, serpentine receptor class ab (A-like)(Srab)",
    "srab-12": "7TM GPCR, serpentine receptor class ab (A-like)(Srab)",
    "srab-14": "Serpentine receptor class alpha/beta-14",
    "srab-20": "7TM GPCR, serpentine receptor class ab (A-like)(Srab)",
    "srab-23": "7TM GPCR, serpentine receptor class ab (A-like)(Srab)",
    "srab-24": "7TM GPCR, serpentine receptor class ab (A-like)(Srab)",
    "srab-4": "7TM GPCR, serpentine receptor class ab (A-like)(Srab)",
    "srab-9": "7TM GPCR, serpentine receptor class ab (A-like)(Srab)",
    "srd-16": "7TM GPCR, serpentine receptor class d (Srd)",
    "srd-17": "7TM GPCR, serpentine receptor class d (Srd)",
    "srd-33": "Serpentine receptor class delta-33",
    "sre-11": "7TM GPCR, serpentine receptor class e (Sre)",
    "sre-30": "Serpentine receptor class epsilon-30",
    "sre-37": "Serpentine receptor class epsilon-37",
    "sre-4": "7TM GPCR, serpentine receptor class e (Sre)",
    "srg-13": "srg-13 is predicted to have transmembrane signaling receptor activity, based on protein domain information.",
    "srg-30": "srg-30 is predicted to have transmembrane signaling receptor activity, based on protein domain information.",
    "srg-36": "srg-36 encodes a G-protein coupled receptor (GPCR) of the serpentine receptor class g (srg) which is involved in perception of ascarosides, which are the major small-molecule components of the dauer pheromone and regulate developmental diapause (dauer), olfactory learning, social behaviors and life-span; srg-36 functions redundantly with srg-37 in the perception of ascaroside C3 to regulate dauer development; srg-36 and srg-37 are localized to the sensory cilia of the ASI chemosensory neuron.",
    "srg-37": "srg-37 encodes a G-protein coupled receptor (GPCR) of the serpentine receptor class g (srg) which is involved in perception of ascarosides, which are the major small-molecule components of the dauer pheromone and regulate developmental diapause (dauer), olfactory learning, social behaviors and life-span; srg-37 functions redundantly with srg-36 in the perception of ascaroside C3 to regulate dauer development; srg-37 and srg-36 are localized to the sensory cilia of the ASI chemosensory neuron.",
    "srg-41": "srg-41 is predicted to have transmembrane signaling receptor activity, based on protein domain information.",
    "srg-47": "srg-47 is predicted to have transmembrane signaling receptor activity, based on protein domain information.",
    "srg-8": "srg-8 is predicted to have transmembrane signaling receptor activity, based on protein domain information.",
    "srh-10": "7TM GPCR, serpentine receptor class h (Srh)",
    "srh-132": "7TM GPCR, serpentine receptor class h (Srh)",
    "srh-139": "7TM GPCR, serpentine receptor class h (Srh)",
    "srh-18": "7TM GPCR, serpentine receptor class h (Srh)",
    "srh-281": "7TM GPCR, serpentine receptor class h (Srh)",
    "srh-68": "7TM GPCR, serpentine receptor class h (Srh)",
    "sro-1": "sro-1 encodes an ortholog of human retinal pigment epithelium-derived rhodopsin homolog (HGNC:RRH); sro-1 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "srsx-3": "srsx-3 encodes an ortholog of human adenosine A3 receptor (HGNC:ADORA3); srsx-3 is involved in G-protein coupled receptor signaling pathway; srsx-3 is predicted to have G-protein coupled receptor activity, based on sequence information; and srsx-3 is an integral component of the membrane and is localized to the nonmotile primary cilium.",
    "srsx-30": "srsx-30 encodes an ortholog of human G protein-coupled receptor 6 (HGNC:GPR6).",
    "srsx-37": "srsx-37 encodes an ortholog of human G protein-coupled receptor 101 (HGNC:GPR101); srsx-37 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "srtx-1": "srtx-1 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "sru-4": "7TM GPCR, serpentine receptor class u (Sru)",
    "srv-11": "7TM GPCR, serpentine receptor class v (Srv)",
    "srx-47": "7TM GPCR, serpentine receptor class x (Srx)",
    "srx-76": "7TM GPCR, serpentine receptor class x (Srx)",
    "srz-13": "7TM GPCR, serpentine receptor class z (Srz)",
    "srz-6": "7TM GPCR, serpentine receptor class z (Srz)",
    "syg-1": "syg-1 encodes a novel transmembrane protein that is a member of the immunoglobulin superfamily of proteins; during larval development, SYG-1 activity is required cell autonomously within the HSNL neuron to specify proper synaptic specificity with its targets, such as vulval muscles and the VC neuron; in regulating synapse formation, SYG-1 acts as a receptor for a second immunoglobulin superfamily protein, SYG-2, a synaptic guidepost protein that interacts with SYG-1 and whose activity is essential for proper SYG-1 localization in HSNL; expression of a SYG-1::GFP reporter fusion in HSNL under the control of the unc-86 promoter reveals that SYG-1 localizes to axons and accumulates at future sites of synaptic vesicle clustering, while expression under an endogenous reporter reveals weak expression in head motorneurons, occasionally in HSN neurons, and in other cells in the vulval region.",
    "syg-2": "syg-2 encodes a transmembrane protein that is a member of the immunoglobulin superfamily of proteins; during larval development, SYG-2 activity is required in vulval epithelial cells for proper synaptic specificity of the HSNL neuron; in regulating synapse formation, SYG-2 acts as a guidepost protein for the SYG-1 receptor that interacts with SYG-2 and acts within HSNL to regulate synaptic specificity; a SYG-2::GFP fusion protein is expressed in the primary vulval cell lineages beginning at the L3 larval stage, with expression increasing during the L4 stage and finally disappearing by adulthood; in embryos, SYG-2::GFP expression is detected in some head neurons and body wall muscles, the latter of which also express the reporter during the L1 and L2 larval stages.",
    "ten-1": "ten-1 encodes a type II transmembrane protein containing EGF-like repeats that is the C. elegans ortholog of Drosophila Ten-m/Odz and vertebrate teneurins (OMIM:300588); in C. elegans, TEN-1 is required for proper development of the gonadal and pharyngeal basement membranes and for proper axonal placement and hypodermal morphogenesis; ten-1 and phy-1 act in parallel influencing the connection between epidermis and muscle during embryonic development; TEN-1 acts as an epidermal receptor for the BM collagens modified by PHY-1 and secreted by the muscle cells; loss of P4H function in ten-1 null mutants results in embryonic lethality due to arrest during late elongation with morphological defects; ten-1; phy-1 embryos have defects in epidermal development and body wall muscles due to basement membrane defects in arrested embryos; TEN-1 is expressed in the embryo and in multiple tissues during postembryonic development including the somatic gonad founder cells Z1 and Z4 and their descendants, as well as in six marginal cells and the M2 neurons in the pharynx; in the embryo, ten-1 expression overlaps with that of lat-1 in the dorsal left epidermoblasts; as ten-1 and lat-1 also display genetic interactions during embryonic development, the overlapping expression patterns suggest that these two genes have overlapping functions during embryogenesis.",
    "tol-1": "tol-1 encodes a predicted transmembrane protein that is the sole C. elegans Toll-like receptor (TLR); TOL-1 is required for proper embryonic development and for pathogen avoidance behavior, and is expressed primarily in the nervous system.",
    "trp-1": "trp-1 encodes a transient receptor potential (TRP) channel that, along with TRP-2 and SPE-41, constitutes the three C. elegans members of the TRPC subfamily; trp-1, along with trp-2, control nicotine-dependent behavior; a TRP-1::GFP reporter fusion is expressed in motor neurons, interneurons, vulval and intestinal muscles, and the BAG sensory neuron.",
    "trp-2": "trp-2 encodes a transient receptor potential (TRP) channel that, along with trp-1 and spe-41, constitutes one of three C. elegans TRPC family members; trp-2, along with trp-1, controls nicotine-dependent behavior.",
    "trpa-1": "trpa-1 encodes a transient receptor potential (TRP) ion channel orthologous to the vertebrate and Drosophila TRPA1 channels; in C. elegans, trpa-1 activity is required for specific mechanosensory behaviors such as nose-touch avoidance and touch-mediated foraging; when expressed in mammalian cells, TRPA-1 exhibits channel activity in response to mechanical stimulation; TRPA-1::GFP reporters are expressed in a number of different cell types including sensory neurons, muscle, and epithelial cells.",
    "trpa-2": "trpa-2 encodes a transient receptor potential (TRP) family channel.",
    "tyra-2": "tyra-2 encodes an ortholog of human 5-hydroxytryptamine (serotonin) receptor 1A, G protein-coupled (HGNC:HTR1A); tyra-2 is predicted to have G-protein coupled receptor activity, based on protein domain information.",
    "unc-29": "unc-29 encodes an non-alpha subunit of the nicotinic acetylcholine receptor (nAChR) superfamily; UNC-29 is required for normal locomotion and egg-laying, and functions as a subunit of a ligand-gated ion channel that likely mediates fast actions of acetylcholine at neuromuscular junctions and in the nervous system; when coexpressed with LEV-1, a non-alpha nAChR subunit, and UNC-38 or UNC-63, alpha AChR subunits, the resulting multimer can form levamisole-gated channels; UNC-29 is expressed in body wall muscle.",
    "unc-40": "unc-40 encodes a netrin receptor that is required to guide dorsal-ventral cell and axon migrations, and is required for correct polarization and migration of the neuroblasts QL and QR; UNC-40 function in both UNC-5-dependent and UNC-5-independent signaling pathways to regulate cell and axon migrations; UNC-5-dependent signaling is likely enhanced by UNC-129, a TGF-beta signaling molecule that is expressed in a gradient opposite that of UNC-6 netrin; UNC-40 is also required, along with UNC-6, for mediating anchor cell (AC) invasion, likely by regulating formation of an AC invasive membrane domain; an UNC-40::GFP fusion protein is expressed on the surface of motile cells and pioneering neurons.",
    "unc-55": "unc-55 encodes a nuclear receptor that is most closely related to Drosophila Seven-up and the vertebrate COUP (chicken ovalbumin upstream promoter) transcription factors; unc-55 activity is required for the VD motor neurons to adopt their normal synaptic pattern; unc-55 is expressed in a number of neurons, including the VD motor neurons.",
    "unc-6": "unc-6 encodes a netrin orthologous to the human and mouse netrin-1 precursor proteins; UNC-6 functions as a guidance molecule that regulates circumferential axon migrations as well as migration of mesodermal cells, such as the gonadal distal tip cell, along the dorsoventral axis; in addition, UNC-6 mediates anchor cell (AC) invasion by regulating localization of the UNC-40 netrin receptor to the invasive plasma membrane of the AC, allowing for subsequent formation of an invasive membrane domain; a secreted molecule, UNC-6 is first expressed during embryogenesis in ventral epidermoblasts; additional expression is seen in neurons and sheath cells; UNC-6 is involved in both attractive and repulsive interactions mediated by the UNC-40 and UNC-5 netrin receptors, respectively.",
    "vab-1": "vab-1 encodes an ephrin receptor; during development, vab-1 activity is required for neural and epithelial morphogenesis as well as for proper axon targeting and neuronal cell migration; in addition, VAB-1 functions as a major sperm protein receptor in a sperm-sensing control mechanism that regulates oocyte meiotic maturation; VAB-1::GFP reporters are expressed in neuronal cells and in oocytes and sheath cells of the proximal gonad.",
    "vab-2": "The vab-2 gene encodes an ephrin molecule related to human ephrin B2 (OMIM:600527); VAB-2, expressed primarily in neuronal cells, is a ligand for the VAB-1 ephrin receptor and plays a role in embryonic cell movements, epidermal morphogenesis during later embryogenesis, and oocyte maturation; VAB-2 synergizes with PTP-3, a LAR-like receptor tyrosine phosphatase, to regulate morphogenesis.",
    "vem-1": "vem-1 encodes a transmembrane protein that contains a cytochrome b5-like heme/steroid-binding domain and is orthologous to mammalian VEMA, a membrane-associated progesterone receptor component; in C. elegans, vem-1 is required for proper axonal guidance of ventral nerve cord neurons; vem-1 interacts genetically with unc-40, whose protein product also interacts with VEM-1; a VEM-1::GFP reporter fusion is expressed from embryonic stages through late larval stages and is found in a subset of neurons, including the AVG pioneer neurons, that extend processes into the ventral nerve cord; microarray experiments indicate that vem-1 transcripts are upregulated in response to treatment with xenobiotics such as clofibrate and beta-naphthoflavone.",
    "ver-2": "ver-2 is involved in nematode male tail tip morphogenesis; and ver-2 is predicted to have ephrin receptor activity, ATP binding activity, and zinc ion binding activity, based on protein domain information.",
    "ver-3": "ver-3 encodes an ortholog of human fms-related tyrosine kinase 1 (HGNC:FLT1); ver-3 is involved in nematode male tail tip morphogenesis; and ver-3 is predicted to have ephrin receptor activity and ATP binding activity, based on protein domain information."
}